WS-I/BP1.2/Messages/BaseDataTypes/XmlFormatter/DocLitW/SoapWsdl.BaseDataTypes.XmlFormatter.DocLitWrapped_RetAnyUri_Client_Request-12.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IBaseDataTypesDocLitW/RetAnyUri</a:Action>
    <a:MessageID>urn:uuid:f58cdda1-aee6-4730-af6a-c0a05fc3015c</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body>
    <RetAnyUri xmlns="http://tempuri.org/">
      <inUri>http://[1080:0000:0000:0000:0008:0800:200C:417A]/foo</inUri>
    </RetAnyUri>
  </s:Body>
</s:Envelope>